# Working with Missing data in pandas

In [2]:
import pandas as pd
import numpy as np

We begin by defining a pandas dataframe that contains some cells with missing values. Note that pandas, in addition to allowing us to create dataframes from a variety of files, also supports explicit declaration.

In [28]:
incomplete_df = pd.DataFrame({'id': [1,2,3,2,2,3,1,1,1,2,4],
                              'type': ['one', 'one', 'two', 'three', 'two', 'three', 'one', 'two', 'one', 'three','one'],
                              'amount': [345,928,np.NAN,645,113,942,np.NAN,539,np.NAN,814,np.NAN] 
                             }, columns=['id','type','amount'])

Column 'amount' is the only one with missing values. Now we display the dataframe

In [6]:
#TODO: display the dataframe
incomplete_df

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two     NaN
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one     NaN
7    1    two   539.0
8    1    one     NaN
9    2  three   814.0
10   4    one     NaN

Recall that summary statistics and arithmetic with missing data is natively supported by pandas. Let's define two series, both containing some missing values.

In [7]:
A = incomplete_df['amount']
B = pd.Series(data=[np.NAN,125,335,345,312,np.NAN,np.NAN,129,551,800,222])

In [8]:
#TODO: print the content of A
print(A)
print ('\n')

#TODO: print the content of B
print(B)

0     345.0
1     928.0
2       NaN
3     645.0
4     113.0
5     942.0
6       NaN
7     539.0
8       NaN
9     814.0
10      NaN
Name: amount, dtype: float64


0       NaN
1     125.0
2     335.0
3     345.0
4     312.0
5       NaN
6       NaN
7     129.0
8     551.0
9     800.0
10    222.0
dtype: float64

The mean is computed normally and missing values are ignored:

In [9]:
# TODO: Compute and print the mean value of A
A.mean()

618.0

In [10]:
np.mean(A)

618.0

Min, Max, STD and Variance all work even when data are missing:

In [13]:
# TDOD: Compute and display the min, max, standard deviation and variance of B
print(B.min())
print(B.max())
print(B.std())
print(B.var())

125.0
800.0
226.90459763647678
51485.69642857143

In [14]:
B.min(), B.max(), B.std(), B.var()

(125.0, 800.0, 226.90459763647678, 51485.69642857143)

We can also perform element-wise arithmetic operations between series with missing data. Note that by definition the result of any operation that involves missing values is NaN.

In [15]:
# TODO: Perform element-wise addition between the values in A and B
A + B

0        NaN
1     1053.0
2        NaN
3      990.0
4      425.0
5        NaN
6        NaN
7      668.0
8        NaN
9     1614.0
10       NaN
dtype: float64

In [16]:
np.add(A, B)

0        NaN
1     1053.0
2        NaN
3      990.0
4      425.0
5        NaN
6        NaN
7      668.0
8        NaN
9     1614.0
10       NaN
dtype: float64

### Filling missing values

Recall that pandas has a function that allows you to drop any rows in a dataframe (or elements in a series) that contain a missing value.

In [17]:
# TODO: Print the values of attribute A before removing the null values
print("original\n", A)


# TODO: now, print the values of A but without the null values 
print("updated\n", A.dropna())

original
 0     345.0
1     928.0
2       NaN
3     645.0
4     113.0
5     942.0
6       NaN
7     539.0
8       NaN
9     814.0
10      NaN
Name: amount, dtype: float64
updated
 0    345.0
1    928.0
3    645.0
4    113.0
5    942.0
7    539.0
9    814.0
Name: amount, dtype: float64

However, very often you may wish to fill in those missing values rather than simply dropping them. Of course, pandas also has that functionality. For example, we could fill missing values with a scalar number, as shown below.

In [18]:
# TODO: replace the missing value with -99 in attribute A
A.fillna(-99)

0     345.0
1     928.0
2     -99.0
3     645.0
4     113.0
5     942.0
6     -99.0
7     539.0
8     -99.0
9     814.0
10    -99.0
Name: amount, dtype: float64

In [19]:
# TODO: replace the missing value with -99 in the dataframe
incomplete_df.fillna(-99)

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two   -99.0
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one   -99.0
7    1    two   539.0
8    1    one   -99.0
9    2  three   814.0
10   4    one   -99.0

That actually works with any data type.

In [20]:
# TODO: fill the missing values with the string 'unknown' in attribute A
print(A.fillna("unknown"))

0         345
1         928
2     unknown
3         645
4         113
5         942
6     unknown
7         539
8     unknown
9         814
10    unknown
Name: amount, dtype: object

As such, we can use this functionality to fill in the gaps with the average value computed across the non-missing values.

In [21]:
# TODO: replace the missing values with the average value of the non-missing values
A.fillna(A.mean())

0     345.0
1     928.0
2     618.0
3     645.0
4     113.0
5     942.0
6     618.0
7     539.0
8     618.0
9     814.0
10    618.0
Name: amount, dtype: float64

Even better, if we want to fill in the gaps with mean values of corresponding *id's* (recall our initial dataframe printed below), the following two lines of code perform that seemingly complex task.

In [22]:
incomplete_df

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two     NaN
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one     NaN
7    1    two   539.0
8    1    one     NaN
9    2  three   814.0
10   4    one     NaN

In [25]:
# Fill in gaps in the 'amount' column with means obtained from corresponding id's in the first column
incomplete_df["amount"].fillna(incomplete_df.groupby("id")["amount"].transform("mean"),inplace=True)

#TODO: display the dataframe. What do you see?
incomplete_df

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two   942.0
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one   442.0
7    1    two   539.0
8    1    one   442.0
9    2  three   814.0
10   4    one     NaN

In [27]:
# TODO: If there is no corresponding id and the cell is still null, simply use the overall mean
incomplete_df["amount"].fillna(incomplete_df["amount"].mean(), inplace=True)
incomplete_df

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two   942.0
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one   442.0
7    1    two   539.0
8    1    one   442.0
9    2  three   814.0
10   4    one   615.2

You can fill values forwards and backwards with the flags *pad* / *ffill* and *bfill* / *backfill*

In [ ]:
# TODO: fill the missing values in B with the values in the previous records (no limit)
print (B)
print ('\n')    # line to separate the output
B.fillna(method = 'pad')

We can set a limit if we only want to replace consecutive gaps.

In [ ]:
# TODO: fill the missing values in B with the value in the next record (the value of a record can be used in the next record only)

### Outlier detection

We can use the data pid.csv to practice on outlier detection

In [2]:
# TODO: read the csv file pid

In [ ]:
# TODO: for each column except the label column, compute the standard deviation of the columns
# report all the values that are at distance > 3 * std from the mean value as outliers.

# Data Transformation

We begin by defining a pandas dataframe that contains some cells with missing values. Note that pandas, in addition to allowing us to create dataframes from a variety of files, also supports explicit declaration.

In [ ]:
df = pd.DataFrame(np.arange(5 * 4). reshape(5, 4))
df

### Data Sampling

To select a random subset without replacement, one way is to slice off the first k elements of the array returned by permutation, where k is the desired subset size. Here, we use the 'take' method, which retrieves elements along a given axis at the given indices. Using this function, we slice off the first three elements:

In [ ]:
# TODO: perform permutation over the index of the dataframe and take the first three records

To generate a sample with replacement, we can draw random integers.

In [ ]:
# TODO: draw three random integer values from the index values of the dataframe 
# (Note that the default index of the dataframe starts from 0)

These random integers can be used as input for the 'take' method, which is then used to sample the data. Since the random integers consistuting the array may be repeated, the rows sampled by this method may also be repeated -- or, in other words, sampled with replacement.

In [ ]:
# Extract the row with indexes drawn in the previous step

### Data Normalization or Standardization

Aside from sampling data, we may also want to normalize or standardize our data.

In [ ]:
# TODO: normalize the data in the df by dividing the values over the sum of the values in the dataframe

In [ ]:
# TODO: normalize the data in the df by dividing the values over the average of the values in the dataframe

In [ ]:
# TODO: normalize the data in the df by mapping the values to the interval [-5,5]